Autodesk.Navisworks.Api.SavedItemChangedEventArgs
Event arguments when a Autodesk.Navisworks.Api.SavedItem hierarchy changes

Autodesk.Navisworks.Api.SavedItemChangedEventArgs.Action
Gets the action that caused the event

Autodesk.Navisworks.Api.SavedItemChangedEventArgs.EditedParts
Gets the parts of the item that were edited (None if Action is not equal to Edit)

Autodesk.Navisworks.Api.SavedItemChangedEventArgs.NewIndex
Gets the index within NewParent at which a Add, Replace, Edit or Move action occurred.

Autodesk.Navisworks.Api.SavedItemChangedEventArgs.NewItem
Gets the item effected by a Add, Replace, Edit or Move action.

Autodesk.Navisworks.Api.SavedItemChangedEventArgs.NewParent
Gets the new Parent of the item effected by a Add, Replace, Edit or Move action.

Autodesk.Navisworks.Api.SavedItemChangedEventArgs.OldIndex
Gets the index within OldParent at which a Remove, Replace, Edit or Move action occurred.

Autodesk.Navisworks.Api.SavedItemChangedEventArgs.OldItem
Gets the old item effected by a Remove, Replace, Edit or Move action. For an Edit action only
the parts of the item specified by EditedParts are valid.

Autodesk.Navisworks.Api.SavedItemChangedEventArgs.OldParent
Gets the old Parent of the item effected by a Remove, Replace, Edit or Move action.